/**
 * @author JarkimZhu
 * Created on 2016-07-12.
 * @version 0.1.0
 * @class
 */
const ExceptionCode = [
    //系统级错误
    {code: 1, name: "参数非法"},

    //简历
    {code: 13001, name: "简历不存在"},
    {code: 13002, name: "商家需要通过简历了解您的信息, 请先创建一份简历"},
    {code: 13006, name: "照片太大啦,请上传低于20M的照片"},
    {code: 13007, name: "QQ格式有误"},
    {code: 13008, name: "微信格式有误"},
    {code: 13009, name: "手机格式有误"},
    {code: 13010, name: "邮箱格式有误"},
    {code: 13011, name: "描述长度超限"},
    {code: 13017, name: "简历保存失败,请联系管理员"},
    {code: 14001, name: "该职位已过期"},
    {code: 14002, name: "请输入一句话简历"},
    {code: 14003, name: "您已经投递过了"},
    {code: 14004, name: "您的简历与该职位要求不符"},

    {code: 25004, name: "频次过快，同业务,一分钟只能访问一次!"},

    //投诉
    {code: 23001, name: "投诉职位不能为空"},
    {code: 23002, name: "投诉内容在10到200个字符之间"},
    {code: 24002, name: "该职位您已投递过了"},

    //发送短信
    {code: 25004, name: "获取验证码失败，重试次数过多，请1分钟后再试"},
    {code: 25005, name: "获取验证码失败，重试次数过多，请10分钟后再试"},
    {code: 25006, name: "获取验证码失败，重试次数过多，请1小时后再试"},
    {code: 25007, name: "获取验证码失败，重试次数过多，请24小时后再试"},

    //支付密码
    {code: 50002, name: "支付密码错误"},
    //支付包
    {code:51001,name:"该帐号已被绑定"},
    {code:53001,name:"提现金额不得少于50元"},
    //
    {code:55002,name:"余额不足"}
];
export default ExceptionCode